DELETE
FROM users;
DELETE
FROM user_roles;
DELETE
FROM dishes;
DELETE
FROM menu_items;
DELETE
FROM restaurants;

ALTER SEQUENCE global_id_seq
  RESTART WITH 10000;

INSERT INTO users (name, email, password)
VALUES ('User', 'user@yandex.ru', 'password'),
       ('Admin', 'admin@gmail.com', 'admin');

INSERT INTO user_roles (role, user_id)
VALUES ('ROLE_USER', 10000),
       ('ROLE_ADMIN', 10001);


INSERT INTO dishes (type, name)
VALUES ('STARTER', 'Салат рыбный'),
       ('STARTER', 'Квашенная капуста'),
       ('SOUP', 'Солянка'),
       ('SOUP', 'Минестроне'),
       ('MAIN', 'Спагетти неополитано'),
       ('MAIN', 'Пельмени'),
       ('DESERT', 'Мороженное'),
       ('DESERT', 'Десерт фруктовый'),
       ('DRINK', 'Кофе эспрессо');

INSERT INTO restaurants (name, address, phone, page)
VALUES ('Мама Рома', 'Санкт-Петербург, пр. Славы, д.30', '', 'http://http://www.mamaroma.ru'),
       ('Сабатони', 'Санкт-Петербург, ул. Есенина, 30А', '+7 (960) 267-47-49', ''),
       ('Бона капона', 'Санкт-Петербург, ул. Есенина, 1,', '', '');

INSERT INTO menu_items (restaurant_id, dish_id, price)
VALUES ('0', '1', '500'),
       ('0', '2', '200'),
       ('0', '3', '300'),
       ('0', '9', '500'),
       ('0', '10', '200'),
       ('0', '11', '300'),
       ('0', '12', '500'),
       ('0', '13', '200'),
       ('0', '14', '300'),
       ('0', '18', '500'),
       ('0', '19', '200'),
       ('0', '20', '300'),
       ('0', '21', '300'),
       ('0', '23', '300'),
       ('0', '24', '500'),
       ('0', '25', '200'),
       ('0', '26', '300'),
       ('1', '1', '5000'),
       ('1', '2', '2000'),
       ('1', '3', '3000'),
       ('1', '9', '5000'),
       ('1', '10', '2000'),
       ('1', '11', '3000'),
       ('1', '12', '5000'),
       ('1', '13', '2000'),
       ('1', '14', '3000'),
       ('1', '18', '5000'),
       ('1', '19', '2000'),
       ('1', '20', '3000'),
       ('1', '21', '3000'),
       ('1', '23', '3000'),
       ('1', '24', '5000'),
       ('1', '25', '2000'),
       ('1', '26', '3000'),
       ('2', '1', '50'),
       ('2', '2', '20'),
       ('2', '3', '30'),
       ('2', '9', '50'),
       ('2', '10', '20'),
       ('2', '11', '30'),
       ('2', '12', '50'),
       ('2', '13', '20'),
       ('2', '14', '30'),
       ('2', '18', '50'),
       ('2', '19', '20'),
       ('2', '20', '30'),
       ('2', '21', '30'),
       ('2', '23', '30'),
       ('2', '24', '50'),
       ('2', '25', '20'),
       ('2', '26', '30');

