DELETE FROM user_roles;
DELETE FROM dishes;
DELETE FROM menu_items;
DELETE FROM restaurants;
DELETE FROM users;

INSERT INTO users (name, email, password) VALUES
  ('User', 'user@yandex.ru', 'password'),
  ('Admin', 'admin@gmail.com', 'admin');

INSERT INTO user_roles (role, user_id) VALUES
  ('ROLE_USER', 1),
  ('ROLE_ADMIN', 2);

INSERT INTO dishes (type, name)
VALUES ('STARTER', 'Салат рыбный'),/*0*/
       ('STARTER', 'Салат Мимоза'),/*1*/
       ('STARTER', 'Салат Оливье'),/*2*/
       ('STARTER', 'Маринованные огурцы'),/*3*/
       ('STARTER', 'Соления по грузински'),/*4*/
       ('STARTER', 'Квашенная капуста'),/*5*/
       ('SOUP', 'Солянка'),/*6*/
       ('SOUP', 'Борщ'),/*7*/
       ('SOUP', 'Щи постные'),/*8*/
       ('SOUP', 'Щи мясные'),/*9*/
       ('SOUP', 'Уха'),/*10*/
       ('SOUP', 'Минестроне'),/*11*/
       ('MAIN', 'Спагетти неополитано'),/*12*/
       ('MAIN', 'Стейк'),/*13*/
       ('MAIN', 'Спагетти Котлета мясная'),/*14*/
       ('MAIN', 'Хинкали из говядины'),/*15*/
       ('MAIN', 'Хинкали из баранины'),/*16*/
       ('MAIN', 'Плов'),/*16*/
       ('MAIN', 'Пельмени'),/*17*/
       ('DESERT', 'Мороженное'),/*18*/
       ('DESERT', 'Торт лимонный'),/*19*/
       ('DESERT', 'Чизкейк'),/*20*/
       ('DESERT', 'Торт малиновый'),/*21*/
       ('DESERT', 'Десерт фруктовый'),/*22*/
       ('DRINKS', 'Чай черный'),/*23*/
       ('DRINKS', 'Чай зеленый'),/*24*/
       ('DRINKS', 'Кофе по восточному'),/*25*/
       ('DRINKS', 'Кофе американо'),/*26*/
       ('DRINKS', 'Кофе эспрессо');/*27*/

INSERT INTO restaurants (name, address, phone, page)
VALUES ('Мама Рома', 'Санкт-Петербург, пр. Славы, д.30', '', 'http://http://www.mamaroma.ru'),
       ('Сабатони', 'Санкт-Петербург, ул. Есенина, 30А', '+7 (960) 267-47-49', ''),
       ('Бона капона', 'Санкт-Петербург, ул. Есенина, 1,', '', '');

INSERT INTO menu_items (restaurant_id, dish_id, price)
VALUES ('0', '1', '500'),
       ('0', '2', '200'),
       ('0', '3', '300'),
       ('0', '9', '500'),
       ('0', '10', '200'),
       ('0', '11', '300'),
       ('0', '12', '500'),
       ('0', '13', '200'),
       ('0', '14', '300'),
       ('0', '18', '500'),
       ('0', '19', '200'),
       ('0', '20', '300'),
       ('0', '21', '300'),
       ('0', '23', '300'),
       ('0', '24', '500'),
       ('0', '25', '200'),
       ('0', '26', '300'),
       ('1', '1', '5000'),
       ('1', '2', '2000'),
       ('1', '3', '3000'),
       ('1', '9', '5000'),
       ('1', '10', '2000'),
       ('1', '11', '3000'),
       ('1', '12', '5000'),
       ('1', '13', '2000'),
       ('1', '14', '3000'),
       ('1', '18', '5000'),
       ('1', '19', '2000'),
       ('1', '20', '3000'),
       ('1', '21', '3000'),
       ('1', '23', '3000'),
       ('1', '24', '5000'),
       ('1', '25', '2000'),
       ('1', '26', '3000'),
       ('2', '1', '50'),
       ('2', '2', '20'),
       ('2', '3', '30'),
       ('2', '9', '50'),
       ('2', '10', '20'),
       ('2', '11', '30'),
       ('2', '12', '50'),
       ('2', '13', '20'),
       ('2', '14', '30'),
       ('2', '18', '50'),
       ('2', '19', '20'),
       ('2', '20', '30'),
       ('2', '21', '30'),
       ('2', '23', '30'),
       ('2', '24', '50'),
       ('2', '25', '20'),
       ('2', '26', '30');

